004_write_orioledb_hybrid/pgbench_write_2022-05-22T08:38:10.735495906.log
progress: 10.0 s, 38365.8 tps, lat 1.271 ms stddev 0.915
progress: 20.0 s, 36278.7 tps, lat 1.353 ms stddev 7.295
progress: 30.0 s, 36262.7 tps, lat 1.354 ms stddev 7.131
progress: 40.0 s, 35520.2 tps, lat 1.383 ms stddev 7.883
progress: 50.0 s, 36095.6 tps, lat 1.360 ms stddev 7.499
progress: 60.0 s, 38497.7 tps, lat 1.274 ms stddev 1.059
progress: 70.0 s, 35289.0 tps, lat 1.391 ms stddev 7.089
progress: 80.0 s, 33282.2 tps, lat 1.477 ms stddev 11.258
progress: 90.0 s, 38677.4 tps, lat 1.268 ms stddev 0.986
progress: 100.0 s, 35958.6 tps, lat 1.365 ms stddev 7.662
progress: 110.0 s, 34750.6 tps, lat 1.414 ms stddev 8.677
progress: 120.0 s, 35751.8 tps, lat 1.373 ms stddev 7.962
progress: 130.0 s, 36364.3 tps, lat 1.350 ms stddev 6.889
progress: 140.0 s, 37714.2 tps, lat 1.301 ms stddev 2.611
progress: 150.0 s, 36044.2 tps, lat 1.362 ms stddev 7.947
progress: 160.0 s, 38431.7 tps, lat 1.276 ms stddev 1.103
progress: 170.0 s, 35944.7 tps, lat 1.366 ms stddev 8.047
progress: 180.0 s, 35392.8 tps, lat 1.388 ms stddev 7.555
progress: 190.0 s, 31863.2 tps, lat 1.543 ms stddev 7.586
progress: 200.0 s, 37487.9 tps, lat 1.309 ms stddev 1.176
progress: 210.0 s, 37293.6 tps, lat 1.315 ms stddev 1.221
progress: 220.0 s, 36715.8 tps, lat 1.337 ms stddev 1.908
progress: 230.0 s, 37849.7 tps, lat 1.296 ms stddev 1.017
progress: 240.0 s, 37396.9 tps, lat 1.312 ms stddev 1.096
progress: 250.0 s, 36739.2 tps, lat 1.336 ms stddev 3.166
progress: 260.0 s, 37872.3 tps, lat 1.295 ms stddev 1.150
progress: 270.0 s, 36603.0 tps, lat 1.339 ms stddev 1.201
progress: 280.0 s, 36519.1 tps, lat 1.346 ms stddev 1.847
progress: 290.0 s, 37520.4 tps, lat 1.308 ms stddev 1.082
progress: 300.0 s, 37201.6 tps, lat 1.319 ms stddev 1.027
progress: 310.0 s, 33816.6 tps, lat 1.453 ms stddev 3.540
progress: 320.0 s, 35221.8 tps, lat 1.394 ms stddev 2.421
progress: 330.0 s, 34158.5 tps, lat 1.438 ms stddev 3.097
progress: 340.0 s, 34138.8 tps, lat 1.440 ms stddev 3.469
progress: 350.0 s, 36077.4 tps, lat 1.361 ms stddev 2.427
progress: 360.0 s, 35319.7 tps, lat 1.391 ms stddev 3.494
progress: 370.0 s, 36725.7 tps, lat 1.336 ms stddev 2.095
progress: 380.0 s, 34463.6 tps, lat 1.426 ms stddev 3.514
progress: 390.0 s, 34763.9 tps, lat 1.413 ms stddev 3.359
progress: 400.0 s, 34813.9 tps, lat 1.411 ms stddev 3.239
progress: 410.0 s, 34255.1 tps, lat 1.434 ms stddev 3.578
progress: 420.0 s, 34470.4 tps, lat 1.425 ms stddev 3.559
progress: 430.0 s, 33848.7 tps, lat 1.452 ms stddev 4.113
progress: 440.0 s, 33672.9 tps, lat 1.460 ms stddev 5.360
progress: 450.0 s, 32249.2 tps, lat 1.525 ms stddev 7.295
progress: 460.0 s, 32461.0 tps, lat 1.516 ms stddev 6.985
progress: 470.0 s, 29150.9 tps, lat 1.690 ms stddev 10.592
progress: 480.0 s, 33239.3 tps, lat 1.479 ms stddev 6.859
progress: 490.0 s, 35701.6 tps, lat 1.375 ms stddev 3.584
progress: 500.0 s, 27871.0 tps, lat 1.769 ms stddev 12.210
progress: 510.0 s, 35513.3 tps, lat 1.383 ms stddev 3.566
progress: 520.0 s, 29047.8 tps, lat 1.675 ms stddev 11.448
progress: 530.0 s, 35785.7 tps, lat 1.389 ms stddev 5.019
progress: 540.0 s, 25971.1 tps, lat 1.900 ms stddev 13.997
progress: 550.0 s, 29094.1 tps, lat 1.694 ms stddev 23.796
progress: 560.0 s, 35558.0 tps, lat 1.381 ms stddev 6.326
progress: 570.0 s, 31154.7 tps, lat 1.581 ms stddev 8.984
progress: 580.0 s, 33516.5 tps, lat 1.467 ms stddev 7.336
progress: 590.0 s, 32344.0 tps, lat 1.521 ms stddev 8.226
progress: 600.0 s, 33488.7 tps, lat 1.468 ms stddev 6.798
progress: 610.0 s, 30317.3 tps, lat 1.624 ms stddev 11.132
progress: 620.0 s, 29058.6 tps, lat 1.696 ms stddev 11.524
progress: 630.0 s, 31851.9 tps, lat 1.544 ms stddev 8.635
progress: 640.0 s, 23119.6 tps, lat 2.137 ms stddev 18.924
progress: 650.0 s, 32652.8 tps, lat 1.507 ms stddev 7.757
progress: 660.0 s, 35404.7 tps, lat 1.388 ms stddev 2.618
progress: 670.0 s, 36815.4 tps, lat 1.333 ms stddev 0.907
progress: 680.0 s, 36933.0 tps, lat 1.329 ms stddev 0.903
progress: 690.0 s, 36423.9 tps, lat 1.348 ms stddev 0.900
progress: 700.0 s, 36535.4 tps, lat 1.344 ms stddev 0.937
progress: 710.0 s, 36647.5 tps, lat 1.340 ms stddev 1.011
progress: 720.0 s, 36450.2 tps, lat 1.347 ms stddev 2.144
progress: 730.0 s, 35996.0 tps, lat 1.349 ms stddev 3.809
progress: 740.0 s, 30886.2 tps, lat 1.612 ms stddev 10.251
progress: 750.0 s, 30830.8 tps, lat 1.597 ms stddev 9.946
progress: 760.0 s, 34851.0 tps, lat 1.410 ms stddev 5.745
progress: 770.0 s, 36971.1 tps, lat 1.327 ms stddev 0.884
progress: 780.0 s, 36388.9 tps, lat 1.350 ms stddev 1.021
progress: 790.0 s, 36469.7 tps, lat 1.346 ms stddev 0.957
progress: 800.0 s, 36785.3 tps, lat 1.335 ms stddev 0.952
progress: 810.0 s, 36375.5 tps, lat 1.350 ms stddev 0.930
progress: 820.0 s, 36445.8 tps, lat 1.348 ms stddev 0.962
progress: 830.0 s, 36011.5 tps, lat 1.364 ms stddev 0.963
progress: 840.0 s, 36029.6 tps, lat 1.363 ms stddev 0.929
progress: 850.0 s, 36916.6 tps, lat 1.330 ms stddev 0.896
progress: 860.0 s, 37437.0 tps, lat 1.311 ms stddev 0.926
progress: 870.0 s, 36791.7 tps, lat 1.335 ms stddev 0.891
progress: 880.0 s, 36662.8 tps, lat 1.339 ms stddev 0.915
progress: 890.0 s, 36741.6 tps, lat 1.336 ms stddev 0.891
progress: 900.0 s, 36457.0 tps, lat 1.347 ms stddev 0.885
progress: 910.0 s, 36811.5 tps, lat 1.334 ms stddev 0.909
progress: 920.0 s, 37539.7 tps, lat 1.308 ms stddev 0.883
progress: 930.0 s, 35071.6 tps, lat 1.401 ms stddev 5.437
progress: 940.0 s, 36617.7 tps, lat 1.341 ms stddev 2.648
progress: 950.0 s, 34415.9 tps, lat 1.428 ms stddev 4.920
progress: 960.0 s, 35679.8 tps, lat 1.377 ms stddev 3.157
progress: 970.0 s, 36897.2 tps, lat 1.331 ms stddev 0.890
progress: 980.0 s, 37043.2 tps, lat 1.325 ms stddev 0.908
progress: 990.0 s, 36850.3 tps, lat 1.332 ms stddev 0.878
progress: 1000.0 s, 37175.1 tps, lat 1.321 ms stddev 0.887
progress: 1010.0 s, 37159.7 tps, lat 1.321 ms stddev 0.890
progress: 1020.0 s, 29907.8 tps, lat 1.647 ms stddev 9.552
progress: 1030.0 s, 32215.7 tps, lat 1.502 ms stddev 8.036
progress: 1040.0 s, 34892.9 tps, lat 1.432 ms stddev 5.599
progress: 1050.0 s, 29416.8 tps, lat 1.675 ms stddev 10.429
progress: 1060.0 s, 29400.6 tps, lat 1.676 ms stddev 10.885
progress: 1070.0 s, 35423.7 tps, lat 1.387 ms stddev 3.410
progress: 1080.0 s, 35909.2 tps, lat 1.368 ms stddev 0.924
progress: 1090.0 s, 36066.6 tps, lat 1.362 ms stddev 0.947
progress: 1100.0 s, 36322.0 tps, lat 1.352 ms stddev 0.897
progress: 1110.0 s, 36016.2 tps, lat 1.364 ms stddev 0.970
progress: 1120.0 s, 36126.4 tps, lat 1.359 ms stddev 0.898
progress: 1130.0 s, 36058.6 tps, lat 1.362 ms stddev 0.925
progress: 1140.0 s, 35674.2 tps, lat 1.377 ms stddev 0.971
progress: 1150.0 s, 35707.0 tps, lat 1.376 ms stddev 0.962
progress: 1160.0 s, 36220.3 tps, lat 1.356 ms stddev 0.938
progress: 1170.0 s, 36152.7 tps, lat 1.358 ms stddev 0.903
progress: 1180.0 s, 36069.9 tps, lat 1.362 ms stddev 0.961
progress: 1190.0 s, 36735.2 tps, lat 1.337 ms stddev 0.896
progress: 1200.0 s, 34452.8 tps, lat 1.427 ms stddev 4.866
progress: 1210.0 s, 29720.9 tps, lat 1.658 ms stddev 9.570
progress: 1220.0 s, 33533.9 tps, lat 1.466 ms stddev 5.957
progress: 1230.0 s, 36092.3 tps, lat 1.361 ms stddev 0.927
progress: 1240.0 s, 36185.8 tps, lat 1.357 ms stddev 1.025
progress: 1250.0 s, 36282.4 tps, lat 1.354 ms stddev 0.905
progress: 1260.0 s, 36143.9 tps, lat 1.359 ms stddev 0.925
progress: 1270.0 s, 36118.5 tps, lat 1.360 ms stddev 0.938
progress: 1280.0 s, 36273.2 tps, lat 1.354 ms stddev 0.944
progress: 1290.0 s, 35922.6 tps, lat 1.367 ms stddev 0.911
progress: 1300.0 s, 6952.3 tps, lat 7.000 ms stddev 121.001
progress: 1310.0 s, 1182.3 tps, lat 42.877 ms stddev 89.920
progress: 1320.0 s, 1456.6 tps, lat 33.659 ms stddev 71.479
progress: 1330.0 s, 399.9 tps, lat 123.439 ms stddev 145.638
progress: 1340.0 s, 25589.2 tps, lat 2.000 ms stddev 12.483
progress: 1350.0 s, 33158.0 tps, lat 1.483 ms stddev 1.723
progress: 1360.0 s, 35391.2 tps, lat 1.388 ms stddev 1.225
progress: 1370.0 s, 35965.9 tps, lat 1.366 ms stddev 1.047
progress: 1380.0 s, 36058.7 tps, lat 1.362 ms stddev 0.953
progress: 1390.0 s, 36249.7 tps, lat 1.355 ms stddev 0.936
progress: 1400.0 s, 36889.3 tps, lat 1.331 ms stddev 0.898
progress: 1410.0 s, 36485.1 tps, lat 1.346 ms stddev 0.867
progress: 1420.0 s, 36703.5 tps, lat 1.338 ms stddev 0.891
progress: 1430.0 s, 36699.0 tps, lat 1.338 ms stddev 0.862
progress: 1440.0 s, 36757.7 tps, lat 1.335 ms stddev 0.851
progress: 1450.0 s, 36935.6 tps, lat 1.329 ms stddev 0.858
progress: 1460.0 s, 36708.9 tps, lat 1.337 ms stddev 0.871
progress: 1470.0 s, 36582.7 tps, lat 1.342 ms stddev 0.914
progress: 1480.0 s, 36381.4 tps, lat 1.350 ms stddev 0.924
progress: 1490.0 s, 36646.7 tps, lat 1.340 ms stddev 0.888
progress: 1500.0 s, 35958.0 tps, lat 1.366 ms stddev 1.707
progress: 1510.0 s, 36637.1 tps, lat 1.339 ms stddev 0.872
progress: 1520.0 s, 36388.2 tps, lat 1.350 ms stddev 0.912
progress: 1530.0 s, 36029.5 tps, lat 1.361 ms stddev 0.917
progress: 1540.0 s, 36242.9 tps, lat 1.357 ms stddev 0.964
progress: 1550.0 s, 36549.1 tps, lat 1.343 ms stddev 0.862
progress: 1560.0 s, 36175.2 tps, lat 1.358 ms stddev 0.901
progress: 1570.0 s, 36509.9 tps, lat 1.345 ms stddev 0.920
progress: 1580.0 s, 36319.3 tps, lat 1.352 ms stddev 0.906
progress: 1590.0 s, 36414.8 tps, lat 1.348 ms stddev 0.895
progress: 1600.0 s, 36768.4 tps, lat 1.335 ms stddev 0.916
progress: 1610.0 s, 36952.5 tps, lat 1.329 ms stddev 0.898
progress: 1620.0 s, 36236.0 tps, lat 1.355 ms stddev 0.906
progress: 1630.0 s, 36553.3 tps, lat 1.344 ms stddev 0.880
progress: 1640.0 s, 36650.0 tps, lat 1.340 ms stddev 0.899
progress: 1650.0 s, 36020.3 tps, lat 1.364 ms stddev 0.884
progress: 1660.0 s, 36318.3 tps, lat 1.352 ms stddev 0.921
progress: 1670.0 s, 36140.7 tps, lat 1.359 ms stddev 0.928
progress: 1680.0 s, 36036.2 tps, lat 1.363 ms stddev 0.896
progress: 1690.0 s, 36346.6 tps, lat 1.351 ms stddev 0.885
progress: 1700.0 s, 36246.3 tps, lat 1.355 ms stddev 0.933
progress: 1710.0 s, 35898.0 tps, lat 1.368 ms stddev 0.924
progress: 1720.0 s, 36260.0 tps, lat 1.355 ms stddev 0.923
progress: 1730.0 s, 36098.5 tps, lat 1.361 ms stddev 0.910
progress: 1740.0 s, 35911.8 tps, lat 1.368 ms stddev 0.942
progress: 1750.0 s, 35432.1 tps, lat 1.387 ms stddev 0.943
progress: 1760.0 s, 36124.8 tps, lat 1.360 ms stddev 0.914
progress: 1770.0 s, 35995.0 tps, lat 1.364 ms stddev 0.940
progress: 1780.0 s, 35104.4 tps, lat 1.400 ms stddev 2.947
progress: 1790.0 s, 36499.3 tps, lat 1.345 ms stddev 0.870
progress: 1800.0 s, 36225.9 tps, lat 1.357 ms stddev 0.924
progress: 1810.0 s, 34403.1 tps, lat 1.429 ms stddev 3.006
progress: 1820.0 s, 36369.7 tps, lat 1.351 ms stddev 0.981
progress: 1830.0 s, 35939.3 tps, lat 1.367 ms stddev 0.910
progress: 1840.0 s, 34096.8 tps, lat 1.442 ms stddev 3.631
progress: 1850.0 s, 35752.5 tps, lat 1.374 ms stddev 0.930
progress: 1860.0 s, 35540.3 tps, lat 1.383 ms stddev 0.939
progress: 1870.0 s, 35404.3 tps, lat 1.388 ms stddev 0.932
progress: 1880.0 s, 35543.2 tps, lat 1.382 ms stddev 1.016
progress: 1890.0 s, 35630.4 tps, lat 1.379 ms stddev 0.945
progress: 1900.0 s, 35259.1 tps, lat 1.393 ms stddev 0.968
progress: 1910.0 s, 34705.9 tps, lat 1.416 ms stddev 1.165
progress: 1920.0 s, 35210.1 tps, lat 1.396 ms stddev 0.940
progress: 1930.0 s, 35207.5 tps, lat 1.396 ms stddev 0.955
progress: 1940.0 s, 33933.2 tps, lat 1.449 ms stddev 1.865
progress: 1950.0 s, 35069.2 tps, lat 1.401 ms stddev 0.944
progress: 1960.0 s, 33752.2 tps, lat 1.457 ms stddev 2.162
progress: 1970.0 s, 34822.7 tps, lat 1.411 ms stddev 1.106
progress: 1980.0 s, 34725.9 tps, lat 1.415 ms stddev 0.987
progress: 1990.0 s, 26898.3 tps, lat 1.834 ms stddev 10.683
progress: 2000.0 s, 32736.3 tps, lat 1.503 ms stddev 4.646
progress: 2010.0 s, 34601.6 tps, lat 1.421 ms stddev 0.985
progress: 2020.0 s, 34066.8 tps, lat 1.434 ms stddev 1.372
progress: 2030.0 s, 27541.3 tps, lat 1.803 ms stddev 11.997
progress: 2040.0 s, 34128.8 tps, lat 1.441 ms stddev 1.036
progress: 2050.0 s, 34715.2 tps, lat 1.416 ms stddev 1.049
progress: 2060.0 s, 28445.6 tps, lat 1.733 ms stddev 8.362
progress: 2070.0 s, 33518.9 tps, lat 1.468 ms stddev 1.469
progress: 2080.0 s, 31723.7 tps, lat 1.551 ms stddev 2.788
progress: 2090.0 s, 34754.1 tps, lat 1.414 ms stddev 0.944
progress: 2100.0 s, 33944.1 tps, lat 1.448 ms stddev 1.152
progress: 2110.0 s, 33976.2 tps, lat 1.447 ms stddev 0.988
progress: 2120.0 s, 33476.2 tps, lat 1.469 ms stddev 1.059
progress: 2130.0 s, 32762.3 tps, lat 1.502 ms stddev 1.696
progress: 2140.0 s, 33848.3 tps, lat 1.453 ms stddev 0.990
progress: 2150.0 s, 33663.8 tps, lat 1.460 ms stddev 1.020
progress: 2160.0 s, 33375.2 tps, lat 1.474 ms stddev 1.131
progress: 2170.0 s, 34228.8 tps, lat 1.436 ms stddev 1.004
progress: 2180.0 s, 33066.8 tps, lat 1.487 ms stddev 1.696
progress: 2190.0 s, 28983.9 tps, lat 1.699 ms stddev 8.092
progress: 2200.0 s, 34020.2 tps, lat 1.447 ms stddev 1.067
progress: 2210.0 s, 33147.1 tps, lat 1.484 ms stddev 1.078
progress: 2220.0 s, 28260.1 tps, lat 1.721 ms stddev 8.303
progress: 2230.0 s, 32218.6 tps, lat 1.548 ms stddev 5.420
progress: 2240.0 s, 33406.5 tps, lat 1.472 ms stddev 1.044
progress: 2250.0 s, 32944.3 tps, lat 1.493 ms stddev 1.078
progress: 2260.0 s, 25384.1 tps, lat 1.945 ms stddev 5.497
progress: 2270.0 s, 33524.7 tps, lat 1.467 ms stddev 1.010
progress: 2280.0 s, 31802.0 tps, lat 1.548 ms stddev 2.633
progress: 2290.0 s, 21642.3 tps, lat 2.285 ms stddev 7.307
progress: 2300.0 s, 33765.8 tps, lat 1.456 ms stddev 1.010
progress: 2310.0 s, 30962.7 tps, lat 1.590 ms stddev 5.018
progress: 2320.0 s, 29491.8 tps, lat 1.659 ms stddev 3.147
progress: 2330.0 s, 23183.6 tps, lat 2.147 ms stddev 7.552
progress: 2340.0 s, 30366.2 tps, lat 1.622 ms stddev 3.395
progress: 2350.0 s, 30512.2 tps, lat 1.614 ms stddev 6.497
progress: 2360.0 s, 24434.6 tps, lat 2.022 ms stddev 8.050
progress: 2370.0 s, 32463.9 tps, lat 1.515 ms stddev 1.157
progress: 2380.0 s, 27392.4 tps, lat 1.778 ms stddev 7.379
progress: 2390.0 s, 29951.8 tps, lat 1.666 ms stddev 4.713
progress: 2400.0 s, 19741.2 tps, lat 2.504 ms stddev 11.675
progress: 2410.0 s, 25594.9 tps, lat 1.931 ms stddev 5.241
progress: 2420.0 s, 25939.3 tps, lat 1.903 ms stddev 5.901
progress: 2430.0 s, 30482.5 tps, lat 1.610 ms stddev 2.654
progress: 2440.0 s, 17087.9 tps, lat 2.896 ms stddev 14.727
progress: 2450.0 s, 17060.8 tps, lat 2.859 ms stddev 13.004
progress: 2460.0 s, 21464.9 tps, lat 2.354 ms stddev 48.200
progress: 2470.0 s, 1031.5 tps, lat 47.973 ms stddev 101.226
progress: 2480.0 s, 229.5 tps, lat 217.372 ms stddev 105.045
progress: 2490.0 s, 2123.5 tps, lat 23.242 ms stddev 58.771
progress: 2500.0 s, 10573.8 tps, lat 4.810 ms stddev 33.068
progress: 2510.0 s, 27245.6 tps, lat 1.776 ms stddev 4.601
progress: 2520.0 s, 17652.8 tps, lat 2.860 ms stddev 28.272
progress: 2530.0 s, 33158.3 tps, lat 1.484 ms stddev 0.640
progress: 2540.0 s, 32065.7 tps, lat 1.530 ms stddev 1.776
progress: 2550.0 s, 27539.6 tps, lat 1.797 ms stddev 4.313
progress: 2560.0 s, 26791.5 tps, lat 1.842 ms stddev 3.976
progress: 2570.0 s, 33181.2 tps, lat 1.483 ms stddev 0.690
progress: 2580.0 s, 25134.9 tps, lat 1.964 ms stddev 5.351
progress: 2590.0 s, 24832.3 tps, lat 1.989 ms stddev 5.715
progress: 2600.0 s, 33127.0 tps, lat 1.485 ms stddev 0.774
progress: 2610.0 s, 33316.8 tps, lat 1.477 ms stddev 0.684
progress: 2620.0 s, 31177.8 tps, lat 1.579 ms stddev 1.741
progress: 2630.0 s, 26608.0 tps, lat 1.854 ms stddev 3.510
progress: 2640.0 s, 32890.8 tps, lat 1.496 ms stddev 0.732
progress: 2650.0 s, 30640.2 tps, lat 1.607 ms stddev 1.986
progress: 2660.0 s, 25037.3 tps, lat 1.972 ms stddev 4.284
progress: 2670.0 s, 32613.4 tps, lat 1.509 ms stddev 0.773
progress: 2680.0 s, 26644.9 tps, lat 1.852 ms stddev 6.786
progress: 2690.0 s, 31763.0 tps, lat 1.545 ms stddev 1.604
progress: 2700.0 s, 28592.3 tps, lat 1.730 ms stddev 2.588
progress: 2710.0 s, 31387.1 tps, lat 1.568 ms stddev 2.564
progress: 2720.0 s, 26513.0 tps, lat 1.861 ms stddev 6.054
progress: 2730.0 s, 25903.1 tps, lat 1.906 ms stddev 3.189
progress: 2740.0 s, 26377.3 tps, lat 1.871 ms stddev 7.551
progress: 2750.0 s, 24464.6 tps, lat 2.019 ms stddev 4.618
progress: 2760.0 s, 27880.7 tps, lat 1.769 ms stddev 2.197
progress: 2770.0 s, 29019.0 tps, lat 1.698 ms stddev 2.882
progress: 2780.0 s, 31844.8 tps, lat 1.546 ms stddev 0.881
progress: 2790.0 s, 32201.1 tps, lat 1.529 ms stddev 1.237
progress: 2800.0 s, 27116.1 tps, lat 1.819 ms stddev 3.229
progress: 2810.0 s, 26551.4 tps, lat 1.858 ms stddev 4.326
progress: 2820.0 s, 27769.6 tps, lat 1.776 ms stddev 4.577
progress: 2830.0 s, 27561.7 tps, lat 1.790 ms stddev 3.234
progress: 2840.0 s, 25125.5 tps, lat 1.964 ms stddev 4.292
progress: 2850.0 s, 23780.6 tps, lat 2.079 ms stddev 6.703
progress: 2860.0 s, 29355.8 tps, lat 1.679 ms stddev 1.711
progress: 2870.0 s, 32044.8 tps, lat 1.537 ms stddev 0.833
progress: 2880.0 s, 26201.9 tps, lat 1.884 ms stddev 3.927
progress: 2890.0 s, 28024.4 tps, lat 1.760 ms stddev 3.070
progress: 2900.0 s, 28191.3 tps, lat 1.749 ms stddev 4.495
progress: 2910.0 s, 28561.1 tps, lat 1.725 ms stddev 3.757
progress: 2920.0 s, 16007.3 tps, lat 3.100 ms stddev 8.736
progress: 2930.0 s, 27315.9 tps, lat 1.806 ms stddev 4.104
progress: 2940.0 s, 30790.7 tps, lat 1.600 ms stddev 0.901
progress: 2950.0 s, 21966.0 tps, lat 2.248 ms stddev 4.216
progress: 2960.0 s, 27117.4 tps, lat 1.823 ms stddev 3.126
progress: 2970.0 s, 25399.0 tps, lat 1.944 ms stddev 7.710
progress: 2980.0 s, 29672.9 tps, lat 1.661 ms stddev 2.450
progress: 2990.0 s, 18894.5 tps, lat 2.622 ms stddev 5.773
progress: 3000.0 s, 28789.6 tps, lat 1.713 ms stddev 2.381
progress: 3010.0 s, 28829.4 tps, lat 1.710 ms stddev 2.858
progress: 3020.0 s, 31437.6 tps, lat 1.566 ms stddev 0.809
progress: 3030.0 s, 6500.9 tps, lat 7.665 ms stddev 25.481
progress: 3040.0 s, 29716.7 tps, lat 1.658 ms stddev 1.587
progress: 3050.0 s, 29784.4 tps, lat 1.655 ms stddev 1.374
progress: 3060.0 s, 22328.8 tps, lat 2.214 ms stddev 3.769
progress: 3070.0 s, 27347.8 tps, lat 1.804 ms stddev 2.063
progress: 3080.0 s, 27460.9 tps, lat 1.797 ms stddev 4.838
progress: 3090.0 s, 16887.5 tps, lat 2.935 ms stddev 7.343
progress: 3100.0 s, 27763.8 tps, lat 1.777 ms stddev 2.123
progress: 3110.0 s, 30338.2 tps, lat 1.624 ms stddev 1.156
progress: 3120.0 s, 29557.0 tps, lat 1.668 ms stddev 1.289
progress: 3130.0 s, 18393.5 tps, lat 2.692 ms stddev 6.300
progress: 3140.0 s, 29433.2 tps, lat 1.675 ms stddev 1.401
progress: 3150.0 s, 25610.3 tps, lat 1.927 ms stddev 5.743
progress: 3160.0 s, 23613.7 tps, lat 2.093 ms stddev 4.502
progress: 3170.0 s, 24032.2 tps, lat 2.056 ms stddev 5.342
progress: 3180.0 s, 29955.2 tps, lat 1.645 ms stddev 1.160
progress: 3190.0 s, 18891.8 tps, lat 2.614 ms stddev 7.029
progress: 3200.0 s, 15898.3 tps, lat 3.119 ms stddev 10.026
progress: 3210.0 s, 28629.7 tps, lat 1.728 ms stddev 2.589
progress: 3220.0 s, 23718.5 tps, lat 2.083 ms stddev 5.331
progress: 3230.0 s, 23735.9 tps, lat 2.080 ms stddev 3.879
progress: 3240.0 s, 20940.1 tps, lat 2.364 ms stddev 5.644
progress: 3250.0 s, 25140.6 tps, lat 1.960 ms stddev 3.978
progress: 3260.0 s, 20003.1 tps, lat 2.480 ms stddev 6.642
progress: 3270.0 s, 18795.3 tps, lat 2.636 ms stddev 6.133
progress: 3280.0 s, 29449.4 tps, lat 1.674 ms stddev 1.256
progress: 3290.0 s, 23249.5 tps, lat 2.126 ms stddev 5.650
progress: 3300.0 s, 17263.1 tps, lat 2.870 ms stddev 7.406
progress: 3310.0 s, 25739.3 tps, lat 1.919 ms stddev 3.996
progress: 3320.0 s, 23900.9 tps, lat 2.067 ms stddev 4.742
progress: 3330.0 s, 24361.2 tps, lat 2.028 ms stddev 3.369
progress: 3340.0 s, 20755.1 tps, lat 2.384 ms stddev 3.955
progress: 3350.0 s, 27581.1 tps, lat 1.788 ms stddev 2.591
progress: 3360.0 s, 15424.3 tps, lat 3.207 ms stddev 10.575
progress: 3370.0 s, 16002.1 tps, lat 3.110 ms stddev 7.885
progress: 3380.0 s, 25453.4 tps, lat 1.941 ms stddev 4.190
progress: 3390.0 s, 24031.4 tps, lat 2.056 ms stddev 4.721
progress: 3400.0 s, 23189.9 tps, lat 2.132 ms stddev 5.565
progress: 3410.0 s, 10218.2 tps, lat 4.866 ms stddev 10.014
progress: 3420.0 s, 28922.7 tps, lat 1.705 ms stddev 1.325
progress: 3430.0 s, 15601.1 tps, lat 3.180 ms stddev 10.517
progress: 3440.0 s, 24280.0 tps, lat 2.029 ms stddev 3.792
progress: 3450.0 s, 14783.9 tps, lat 3.368 ms stddev 7.876
progress: 3460.0 s, 24257.5 tps, lat 2.037 ms stddev 4.135
progress: 3470.0 s, 23961.4 tps, lat 2.063 ms stddev 4.956
progress: 3480.0 s, 13535.0 tps, lat 3.655 ms stddev 10.325
progress: 3490.0 s, 14092.6 tps, lat 3.516 ms stddev 22.349
progress: 3500.0 s, 222.7 tps, lat 220.912 ms stddev 122.247
progress: 3510.0 s, 1367.2 tps, lat 37.069 ms stddev 82.724
progress: 3520.0 s, 1032.2 tps, lat 48.076 ms stddev 102.322
progress: 3530.0 s, 2644.9 tps, lat 19.116 ms stddev 62.150
progress: 3540.0 s, 7422.7 tps, lat 1.665 ms stddev 0.884
progress: 3550.0 s, 23865.4 tps, lat 3.629 ms stddev 126.502
progress: 3560.0 s, 28555.2 tps, lat 1.737 ms stddev 1.490
progress: 3570.0 s, 19690.0 tps, lat 2.515 ms stddev 5.893
progress: 3580.0 s, 18241.5 tps, lat 2.717 ms stddev 5.738
progress: 3590.0 s, 25531.4 tps, lat 1.934 ms stddev 2.559
progress: 3600.0 s, 16788.8 tps, lat 2.953 ms stddev 6.037
transaction type: pgbench_write_orioledb.sql
scaling factor: 1
query mode: simple
number of clients: 50
number of threads: 5
duration: 3600 s
number of transactions actually processed: 109633986
latency average = 1.617 ms
latency stddev = 9.161 ms
tps = 30453.871881 (including connections establishing)
tps = 30453.917055 (excluding connections establishing)
statement latencies in milliseconds:
         0.000  \set region_id 0
         0.005  \set ns_id random_zipfian(1, 10, 1.1)
         0.002  \set emitter random_zipfian(1000, 3000, 1.1)
         0.001  \set root_player_id random(1, 100000*:scale)
         0.003  \set currency_id random_zipfian(1, 50, 1.1)
         0.000  \set amount random(1, 10000)
         0.096  BEGIN;
         0.314  INSERT INTO trx_pgbench_0
         0.236  INSERT INTO op_pgbench_0
         0.174  INSERT INTO balance_version_pgbench_0
         0.225  INSERT INTO balance_pgbench_0
         0.561  END;